{
    "User Id": 70,
    "Stage 1 dialogue": {
        "timestamp": "2023-09-16T10:00:00",
        "Dialogue": [
            {
                "role": "Student",
                "round": 1,
                "content": "Hi, I'm Elena Torres. This is my first time here."
            },
            {
                "role": "Counselor",
                "round": 1,
                "content": "Hi, Elena! Welcome! How are you feeling today?"
            },
            {
                "role": "Student",
                "round": 2,
                "content": "I'm a bit overwhelmed. I just started my Psychology classes after a summer filled with mental health workshops."
            },
            {
                "role": "Counselor",
                "round": 2,
                "content": "That sounds like a meaningful summer! What's been causing you to feel overwhelmed?"
            },
            {
                "role": "Student",
                "round": 3,
                "content": "I was excited to share my insights, but during my first class, I noticed my classmates seemed more focused on grades than real discussions."
            },
            {
                "role": "Counselor",
                "round": 3,
                "content": "It can be disappointing when peers don't share the same enthusiasm. Have you had a chance to express your thoughts in class?"
            },
            {
                "role": "Student",
                "round": 4,
                "content": "I tried, but it felt like my ideas were brushed off, which left me feeling disheartened."
            },
            {
                "role": "Counselor",
                "round": 4,
                "content": "That sounds tough. It's understandable to feel frustrated in that situation. Let's explore how you might approach this moving forward."
            }
        ]
    },
    "Stage 2 dialogue": {
        "timestamp": "2023-09-29T15:00:00",
        "Dialogue": [
            {
                "role": "Student",
                "round": 1,
                "content": "Hi, I'm back. I've been feeling kind of lonely lately."
            },
            {
                "role": "Counselor",
                "round": 1,
                "content": "Hi, Elena! I'm glad you came back. What has been going on?"
            },
            {
                "role": "Student",
                "round": 2,
                "content": "I talked to my brother about my disconnect with classmates, but he just told me to focus on my grades."
            },
            {
                "role": "Counselor",
                "round": 2,
                "content": "I'm sorry to hear that. It must feel frustrating to not get the support you were hoping for. How did that make you feel?"
            },
            {
                "role": "Student",
                "round": 3,
                "content": "I felt really unsupported and it caused me to doubt if I should keep pursuing my passion."
            },
            {
                "role": "Counselor",
                "round": 3,
                "content": "It's completely normal to feel that way. Sometimes it helps to reframe how you look at your classmates' attitudes. What do you think might help you regain some confidence in your ideas?"
            }
        ]
    },
    "Stage 3 dialogue": {
        "timestamp": "2023-10-10T14:00:00",
        "Dialogue": [
            {
                "role": "Student",
                "round": 1,
                "content": "Hey, I need to discuss my community project."
            },
            {
                "role": "Counselor",
                "round": 1,
                "content": "Hello again, Elena! What's happening with the project?"
            },
            {
                "role": "Student",
                "round": 2,
                "content": "I'm excited about my topic on social issues in mental health, but during our group meeting, my ideas felt ignored."
            },
            {
                "role": "Counselor",
                "round": 2,
                "content": "That must have been discouraging. How did that affect your motivation for the project?"
            },
            {
                "role": "Student",
                "round": 3,
                "content": "I ended up withdrawing from sharing my ideas. I felt like my creativity wasn't valued."
            },
            {
                "role": "Counselor",
                "round": 3,
                "content": "That's really tough, especially when you want to make an impact. Is there a way you can express your thoughts differently or find allies in your class?"
            }
        ]
    },
    "Stage 4 dialogue": {
        "timestamp": "2023-11-01T13:00:00",
        "Dialogue": [
            {
                "role": "Student",
                "round": 1,
                "content": "Hi, I want to talk about my presentation today."
            },
            {
                "role": "Counselor",
                "round": 1,
                "content": "Hi, Elena! How did your presentation go?"
            },
            {
                "role": "Student",
                "round": 2,
                "content": "I felt so much pressure and when I presented, I struggled to connect with my audience. They seemed indifferent."
            },
            {
                "role": "Counselor",
                "round": 2,
                "content": "I can imagine how that felt. It's hard to put your heart into something and not feel it resonate. What are you feeling now after that experience?"
            },
            {
                "role": "Student",
                "round": 3,
                "content": "I feel like I failed and I'm questioning if I should switch to something like art therapy instead."
            },
            {
                "role": "Counselor",
                "round": 3,
                "content": "It's completely fine to reflect on your path and consider new directions. Have you thought about how you might combine both passions in a way that feels fulfilling?"
            }
        ]
    }
}