{
    "User Id": 18,
    "Stage 1 dialogue": {
        "timestamp": "2023-09-15T10:00:00Z",
        "Dialogue": {
            "Student": "Hi, I’m Sophie Kim. It’s my first time here.",
            "Counselor": "Hello, Sophie! It’s nice to meet you. How are you feeling today?",
            "Student": "I’m excited but a bit overwhelmed. I just started my semester in Environmental Science.",
            "Counselor": "That’s understandable. Starting a new semester can come with a lot of pressure. What’s been overwhelming you?",
            "Student": "I’m taking multiple challenging courses and I'm also leading the campus environmental club. I’m starting to feel anxious about managing everything.",
            "Counselor": "It sounds like you have a lot on your plate. Have you been able to talk to anyone about how you’re feeling?",
            "Student": "Not really. I feel embarrassed to admit that I’m struggling.",
            "Counselor": "It’s completely normal to feel this way. Many students find it hard to balance everything. Sometimes expressing these feelings can really help. Would you like to explore some ways to manage your responsibilities?"
        }
    },
    "Stage 2 dialogue": {
        "timestamp": "2023-09-30T11:00:00Z",
        "Dialogue": {
            "Student": "Hi again. I’m still feeling anxious.",
            "Counselor": "Hi, Sophie! I’m glad you came back. What’s been going on?",
            "Student": "My anxiety has increased. During our last club meeting, members expressed frustration about our project progress, and I just felt so pressured.",
            "Counselor": "That sounds really tough. It’s understandable to feel the weight of their expectations, especially when you’re already feeling overwhelmed.",
            "Student": "Yeah, I ended up withdrawing from the conversation because I didn’t know how to respond.",
            "Counselor": "Withdrawing can sometimes feel like the easiest option, but it can also leave you feeling isolated. Have you considered reaching out to those club members to communicate how you’re feeling?",
            "Student": "I haven’t. I think I’m just too scared of letting them down.",
            "Counselor": "It’s a common fear, but you might be surprised to find they appreciate your honesty. How might you feel about approaching them to discuss your challenges?"
        }
    },
    "Stage 3 dialogue": {
        "timestamp": "2023-10-20T14:00:00Z",
        "Dialogue": {
            "Student": "Hello, I had a pretty tough week.",
            "Counselor": "Hi, Sophie! I’m sorry to hear that. What happened?",
            "Student": "I missed a deadline for an important lab project, and I broke down afterward.",
            "Counselor": "That sounds very stressful. It’s understandable to feel overwhelmed when things don’t go as planned. How are you feeling now?",
            "Student": "I feel guilty for letting everyone, especially my club, down.",
            "Counselor": "It’s important to remember that everyone makes mistakes. How did your friend Mia respond when you talked to her about it?",
            "Student": "She was really supportive, but I still feel like I’m failing at everything.",
            "Counselor": "It’s great that Mia is there for you. How might you reframe your experience to see this as an opportunity to learn rather than just a failure?"
        }
    },
    "Stage 4 dialogue": {
        "timestamp": "2023-11-05T15:00:00Z",
        "Dialogue": {
            "Student": "Hi! I decided to meet with a university counselor.",
            "Counselor": "That’s wonderful to hear, Sophie! How did your meeting go?",
            "Student": "It was helpful. We talked about my anxiety and the pressures I feel. They gave me some time management advice.",
            "Counselor": "I’m glad you found it helpful! What strategies did they suggest?",
            "Student": "They recommended prioritizing my tasks and setting realistic goals. But I’m still unsure if I can implement those changes.",
            "Counselor": "It’s normal to feel unsure when implementing new strategies. Just remember to take it one step at a time. How are you feeling about your responsibilities now?",
            "Student": "I feel a bit relieved after talking about my struggles, but I still worry about disappointing others.",
            "Counselor": "It’s okay to have those worries, but talking openly with your peers can foster understanding. You’re making progress, and that’s what matters. What’s your plan moving forward?",
            "Student": "I think I’ll start small and try to reach out to my club members. Thanks for all your support!"
        }
    }
}