{
    "User Id": 51,
    "Stage 1 dialogue": {
        "timestamp": "2023-09-16T10:00:00Z",
        "Dialogue": {
            "Student": "Hello! I’m Sophia Patel. Nice to meet you.",
            "Counselor": "Hi Sophia! It’s great to meet you too. How are you feeling today?",
            "Student": "I’ve been feeling a bit anxious lately. I have a group project in my Environmental Science class that’s coming up.",
            "Counselor": "That sounds stressful. What specifically is making you feel anxious about it?",
            "Student": "I’m just worried I won’t be able to express my ideas in the group. There’s this classmate, Mark, who tends to dominate the discussions.",
            "Counselor": "It’s understandable to feel that way, especially if you’re passionate about the topic. Can you tell me more about the project?",
            "Student": "We have to research a local environmental issue and present it together. I really want to contribute but feel overshadowed.",
            "Counselor": "It sounds like you’re feeling a lot of pressure. What ideas do you have for how you can express your thoughts during the project meetings?"
        }
    },
    "Stage 2 dialogue": {
        "timestamp": "2023-09-30T10:00:00Z",
        "Dialogue": {
            "Student": "Hi again. I wanted to talk about the group project. I'm feeling really stressed.",
            "Counselor": "Hi Sophia! I'm glad you came back. What’s been stressing you out specifically?",
            "Student": "As the deadline approaches, I find it hard to voice my opinions in meetings. Mark’s ideas seem to always take the lead.",
            "Counselor": "That sounds really frustrating. Have you had the chance to voice your concerns with your group or perhaps with Mark?",
            "Student": "No, I haven’t. I’m afraid of conflict and worry they won't take my ideas seriously.",
            "Counselor": "It’s completely natural to feel that way, but keeping everything inside can make it worse. What if you started by sharing your thoughts with Mark privately first?",
            "Student": "I guess that could work. At least I’d know he heard me, but I’m still scared.",
            "Counselor": "It’s okay to feel scared. Remember, you deserve to be heard, and expressing yourself could lead to a better group dynamic."
        }
    },
    "Stage 3 dialogue": {
        "timestamp": "2023-10-21T10:00:00Z",
        "Dialogue": {
            "Student": "Hi, I really need to talk about the project again. It's getting worse.",
            "Counselor": "Hi, Sophia! I’m here for you. What’s been going on?",
            "Student": "With only a week left before the presentation, I’ve started to withdraw. I just don’t feel good enough.",
            "Counselor": "That sounds really tough. Has withdrawing helped or made you feel worse?",
            "Student": "It’s made me feel worse. I miss the feedback and support from the group, but I don’t want to feel inadequate.",
            "Counselor": "That makes sense. Missing that sense of collaboration can leave you feeling isolated. Maybe you could find a small way to re-engage with the group?",
            "Student": "I should try. I’ve been avoiding social situations in general, thinking I’d better focus on my work.",
            "Counselor": "Balance is important. Connecting with your peers might help alleviate some of that pressure you’re feeling."
        }
    },
    "Stage 4 dialogue": {
        "timestamp": "2023-11-06T10:00:00Z",
        "Dialogue": {
            "Student": "Hi, I just wanted to talk about the presentation today.",
            "Counselor": "Hi again, Sophia! How did it go?",
            "Student": "Honestly, it was really nerve-wracking. I stumbled through my part, and afterward, I felt so frustrated.",
            "Counselor": "I’m sorry to hear that. It’s important to acknowledge how you felt during the presentation. Did you receive any positive feedback?",
            "Student": "Mark did say that my sections were good, but I just couldn't shake the feeling of inadequacy.",
            "Counselor": "That’s completely valid. Sometimes, even positive feedback doesn’t erase that inner critic. How do you feel now reflecting on it?",
            "Student": "I feel conflicted. I want to believe in myself, but it’s hard when I compare myself to Mark.",
            "Counselor": "It's a process to build self-esteem, especially when you have high standards for yourself. Remember, your unique perspective is valuable too."
        }
    }
}