{
    "User Id": 4,
    "Stage 1 dialogue": {
        "timestamp": "2023-11-06T09:00:00",
        "Dialogue": {
            "Student": "Hi, I'm Daniela Rossi. It’s nice to meet you.",
            "Counselor": "Hi Daniela! It’s great to meet you too. How are you feeling today?",
            "Student": "Honestly, I'm feeling pretty overwhelmed with my Graphic Design program. It's just started, and I'm already feeling the pressure.",
            "Counselor": "I understand. Starting a new semester can feel intense, especially with the demands of your field. What’s particularly been weighing on you?",
            "Student": "I submitted my first major project, but I received some constructive criticism from my professor that left me questioning my skills.",
            "Counselor": "That sounds really tough. Constructive feedback can sometimes feel disheartening, especially if you’re already feeling insecure. How are you coping with those feelings?",
            "Student": "I’m not sure. I just feel anxious about living up to my family’s expectations, particularly since my dad is a successful painter.",
            "Counselor": "I can see how that pressure could be overwhelming. It’s natural to want to impress those we admire. Have you talked to anyone in your family about how you're feeling?",
            "Student": "I haven’t really. I don’t want to worry them or seem like I can't handle things.",
            "Counselor": "It's understandable to feel that way, but keeping things inside can sometimes make it harder to cope. It might help to share your feelings. Would you consider talking to them?",
            "Student": "I might, but I’m nervous about it. I really don’t want to fail in their eyes.",
            "Counselor": "Remember, everyone has their struggles, even successful people. Talking to them might provide some comfort and support. Would you like to set a goal about reaching out to someone?",
            "Student": "Yes, that sounds good. Maybe I can talk to my brother Matteo about it since he’s studying architecture.",
            "Counselor": "That sounds like a solid plan! Let’s check in next week to see how that conversation goes. Does that work for you?",
            "Student": "Definitely! Thank you for your help today. I really appreciate it."
        }
    },
    "Stage 2 dialogue": {
        "timestamp": "2023-11-13T09:00:00",
        "Dialogue": {
            "Student": "Hi, it’s me again. This week has been pretty challenging.",
            "Counselor": "Welcome back, Daniela! What’s been happening since we last spoke?",
            "Student": "I talked to Matteo about my feelings. It helped a bit, but I still find it hard to voice my opinions in group projects.",
            "Counselor": "I’m glad you reached out to your brother! It’s great to hear it helped. When you say it’s hard to voice your opinions, can you tell me more about that?",
            "Student": "Well, I feel overshadowed by more outspoken classmates. I worry that my ideas won’t be valued.",
            "Counselor": "That’s a common concern, especially in creative fields. Have you thought about ways to assert yourself or slowly work on expressing your thoughts?",
            "Student": "Not really. I just kind of freeze up when it’s my turn to speak.",
            "Counselor": "How about setting a small goal for your next group session, like raising your hand to share at least one idea? It could help ease you back into it.",
            "Student": "That sounds doable! I can at least try to contribute more.",
            "Counselor": "That’s a fantastic mindset! Taking one step at a time is key. Remember, your contributions matter just as much as anyone else's.",
            "Student": "Thank you for that reminder. I think I really need to hear it.",
            "Counselor": "Of course! Let’s follow up next week to see how it goes. You’re doing great, Daniela!"
        }
    },
    "Stage 3 dialogue": {
        "timestamp": "2023-11-20T09:00:00",
        "Dialogue": {
            "Student": "Hi! I’m back. I’ve been feeling really anxious again.",
            "Counselor": "Hi, Daniela! I’m glad you’re here. What’s been happening this week?",
            "Student": "I went to a family gathering, and my dad showcased his artwork. It made me feel so inferior.",
            "Counselor": "I’m sorry to hear that. Family gatherings can often trigger comparisons. How did that experience make you feel?",
            "Student": "It intensified my feelings of inadequacy. I felt like I was stuck in a shadow, and it made me less motivated in my design work.",
            "Counselor": "It’s tough to feel overshadowed, especially in a creative field. Have you found any ways to express those feelings after the gathering?",
            "Student": "Not really. I just felt trapped and didn’t want to talk to anyone.",
            "Counselor": "It might help to express those feelings, even through journaling or creating art. Have you thought about using your creativity as an outlet?",
            "Student": "That could be helpful! Maybe I can try channeling those feelings into a painting or a design project.",
            "Counselor": "That sounds like a wonderful idea, Daniela. Art can be a therapeutic way to process emotions. Would you like to set a goal to create something this week?",
            "Student": "Yes! I’ll aim to start a new painting this weekend."
        }
    },
    "Stage 4 dialogue": {
        "timestamp": "2023-11-27T09:00:00",
        "Dialogue": {
            "Student": "Hi, I’m back again! I did start painting this weekend.",
            "Counselor": "Hi Daniela! I’m happy to see you again. That’s great news! How did the painting go?",
            "Student": "It felt really good to express myself. I think I managed to channel a lot of my feelings into it.",
            "Counselor": "That’s wonderful! Art is such a powerful way to express emotions. Do you feel like this helped alleviate some of your anxiety?",
            "Student": "Yes, it did. But I still struggle with my confidence in class.",
            "Counselor": "That’s okay. Remember progress isn’t linear, and it’s great that you’re finding ways to express yourself. What’s the next small step you can take in class?",
            "Student": "Maybe I can share my painting experience with my classmates, just to open up a conversation.",
            "Counselor": "That sounds like a fantastic plan! Sharing your experiences can help you connect. Let’s keep working together on building your confidence.",
            "Student": "Thank you so much! I appreciate all your support. I feel hopeful about the changes I’m making."
        }
    }
}