{
    "User Id": 83,
    "Stage 1 dialogue": {
        "timestamp": "2023-09-15T10:00:00Z",
        "Dialogue": {
            "Student": "Hi there! I’m Ethan Smith. This is my first time here.",
            "Counselor": "Hello Ethan! It’s great to meet you. How can I assist you today?",
            "Student": "I’m feeling a bit frustrated about my political science class. I was really looking forward to some engaging debates, but it’s mostly lectures and memorization.",
            "Counselor": "That sounds disappointing, especially when you were looking forward to a dynamic learning environment. Have you discussed this with your professor?",
            "Student": "Yes, I approached Mr. Thompson, but he seemed indifferent to my concerns. Now I’m questioning if I chose the right major.",
            "Counselor": "It’s understandable to feel that way when you expect a certain atmosphere and don’t receive it. What do you enjoy most about political science?"
        }
    },
    "Stage 2 dialogue": {
        "timestamp": "2023-09-30T10:00:00Z",
        "Dialogue": {
            "Student": "Hey, I’m back! I feel more anxious now.",
            "Counselor": "Welcome back, Ethan! What’s been going on?",
            "Student": "I noticed my classmates feel the same way, so I started a study group hoping to foster more discussions. But now I’m feeling overwhelmed.",
            "Counselor": "That shows a lot of initiative! What specifically is making you feel overwhelmed?",
            "Student": "I really want to motivate everyone, but I’m starting to worry I’m not effective at leading. I’m scared they won’t take me seriously.",
            "Counselor": "It’s normal to have those fears, especially when you’re in a leadership position. What traits do you think make you a good candidate to inspire others?"
        }
    },
    "Stage 3 dialogue": {
        "timestamp": "2023-10-20T10:00:00Z",
        "Dialogue": {
            "Student": "Hi there! I’m feeling really burnt out this week.",
            "Counselor": "Hello, Ethan. I’m here to help. What has been causing this burnout?",
            "Student": "Maintaining the study group while trying to excel in class is harder than I thought. I feel like I’m failing at both.",
            "Counselor": "That’s a heavy load to carry. Have you reached out to your friends or peers about how you’re feeling?",
            "Student": "Not really. I just feel ashamed of being unable to enhance their learning experiences.",
            "Counselor": "It’s okay to express these feelings. Sometimes sharing your struggles can strengthen bonds and make everyone feel supported. Would you consider opening up to them?"
        }
    },
    "Stage 4 dialogue": {
        "timestamp": "2023-11-05T10:00:00Z",
        "Dialogue": {
            "Student": "I finally opened up during our last group meeting, and it felt good to share my struggles.",
            "Counselor": "That’s a big step, Ethan! How did your peers respond?",
            "Student": "They were very receptive and shared their own challenges. But I still struggle with feelings of inadequacy.",
            "Counselor": "It's wonderful that you created an atmosphere of support. Remember, it’s okay to feel inadequate sometimes, but it doesn’t define your abilities.",
            "Student": "Realizing I need support is tough. I’m thinking about reaching out to counseling services.",
            "Counselor": "That’s a positive decision. It’s great that you’re recognizing you deserve support. I’m here for you as you navigate this process.",
            "Student": "Thanks so much! I appreciate your help.",
            "Counselor": "You’re very welcome, Ethan. Take care and feel free to return whenever you need support!"
        }
    }
}