{
    "User Id": 60,
    "Stage 1 dialogue": {
        "timestamp": "2023-09-15T09:00:00Z",
        "Dialogue": {
            "Student": "Hi, I'm Ethan. It's nice to meet you!",
            "Counselor": "Hello, Ethan! It's great to meet you too. What would you like to talk about today?",
            "Student": "I’m really excited about this semester! I’m studying Psychology, and I’m also hoping to volunteer more in mental health advocacy.",
            "Counselor": "That sounds like a wonderful opportunity! What’s inspiring you to get involved in mental health advocacy?",
            "Student": "I want to help people, especially my friend Jake. He’s been struggling with anxiety lately, and I feel a lot of pressure to support him.",
            "Counselor": "It’s admirable that you want to help your friend, but it’s understandable to feel some pressure. How do you feel about balancing your studies and supporting Jake?"
        }
    },
    "Stage 2 dialogue": {
        "timestamp": "2023-09-30T15:30:00Z",
        "Dialogue": {
            "Student": "Hi again. I feel more overwhelmed now. Juggling my studies and supporting Jake is tougher than I expected.",
            "Counselor": "Hello, Ethan! I’m glad you came back. Can you tell me more about what’s been overwhelming you?",
            "Student": "I’m staying awake late worrying about Jake and my classes. I feel like I’m falling behind in both areas.",
            "Counselor": "That sounds really tough. It’s important to look after your own well-being too while trying to help Jake. Have you considered setting boundaries on how much you can take on?",
            "Student": "I’m not sure. I just feel like if I don’t help him enough, I’m failing as a friend.",
            "Counselor": "It’s natural to feel that way, but remember that you can’t pour from an empty cup. Finding balance is key. What activities do you enjoy that could help you relieve some of this pressure?"
        }
    },
    "Stage 3 dialogue": {
        "timestamp": "2023-10-20T14:00:00Z",
        "Dialogue": {
            "Student": "Hey, I've just come from a meeting for a mental health initiative, and I felt really detached from everything.",
            "Counselor": "Hi, Ethan. I’m sorry to hear that. What contributed to that feeling of detachment?",
            "Student": "I was worried about Jake, and after discussing plans, I realized I'm not as prepared as I should be. I felt lost.",
            "Counselor": "It seems like you have a lot on your mind. Have you had a chance to talk to anyone about how you’re feeling?",
            "Student": "I talked to my sister, Mia, but I still feel burdened. I fear I'm letting Jake and myself down.",
            "Counselor": "That’s a heavy weight to carry, Ethan. You are doing your best, and it’s okay to seek help. What small steps can you take to feel more grounded right now?"
        }
    },
    "Stage 4 dialogue": {
        "timestamp": "2023-11-05T10:30:00Z",
        "Dialogue": {
            "Student": "Hi! After talking with my family, I decided to see the campus counselor. I shared how overwhelmed I've been.",
            "Counselor": "That’s a great step, Ethan! How did that conversation go for you?",
            "Student": "It felt relieving to share my feelings. They suggested creating boundaries to help me manage my time better.",
            "Counselor": "That sounds like valuable advice. How do you feel about implementing those changes?",
            "Student": "I feel a bit hopeful, but I’m still uncertain about balancing everything, especially supporting Jake.",
            "Counselor": "It's completely normal to feel uncertain about changes. Maybe start with small boundaries and gradually build on them. Remember, you are allowed to prioritize your well-being.",
            "Student": "Thank you. I appreciate your support! I’m going to try to reach out to Jake and suggest a casual hangout.",
            "Counselor": "That sounds like a great idea! Keep nurturing that connection. I’m here if you need further support!"
        }
    }
}